#include "ResourceIds.hpp"

/* ========================================================================= */
/* 1. アドオン情報                                                           */
/* ========================================================================= */
'STR#' 32000 "Add-on Name and Description" {
/* [  1] */		"maedaアドオン"
/* [  2] */		"maedaアドオン 説明 v-002"
}

/* ========================================================================= */
/* 2. メニュー                                                               */
/* ========================================================================= */
'STR#' 32500 "Menu Strings" {
/* [  1] */		"maedaアドオン"
/* [  2] */		"maeda検索ダイアログ..."
}

/* ========================================================================= */
/* 3. 検索ダイアログ                                                         */
/* ========================================================================= */
'GDLG' 32501 Modal | noGrow 40 40 450  250  "要素プロパティリスト" {
    /* 検索ボタン */
    Button  330 200 90 25  LargePlain "検索"

    /* ツール別チェックボックス */
    CheckBox  10 80 230 20 LargePlain "壁"
    CheckBox  10 100 230 20 LargePlain "柱"
    CheckBox  10 120 230 20 LargePlain "梁"
    CheckBox  10 140 230 20 LargePlain "スラブ"
    CheckBox  10 160 230 20 LargePlain "窓 / ドア"
    CheckBox  10 180 230 20 LargePlain "オブジェクト"

    /* 階数別チェックボックス */
    CheckBox  10 10 230 15 LargePlain "地下１階"
    CheckBox  10 25 230 15 LargePlain "1階"
    CheckBox  10 40 230 15 LargePlain "2階"
    CheckBox  10 55 230 15 LargePlain "3階"
}

/* ========================================================================= */
/* 4. 検索結果ダイアログ                                                     */
/* ========================================================================= */
'GDLG' 32502 Modal | grow   0   0  800  400  "検索結果リスト" {
    /* (1) 結果リスト */
    MultiSelList   10   10  780  340  LargePlain   PartialItems   HVScroll     24        HasHeader   22
    /* (2) 閉じるボタン */
    Button        700  360   90   30  LargePlain "閉じる"
}
